app/views/users/index.html.erb

<%= javascript_tag do %>
  window.tracks = <%=raw Track.all.to_json %>
---
SELECT "tracks".* FROM "tracks"