app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 21 Feb 2014 21:28:15 UTC +00:00], ["description", ""], ["title", ""], ["updated_at", Fri, 21 Feb 2014 21:28:15 UTC +00:00]]
---
	def create
		@track = Track.new(track_params)
		url = @track.clip.url.to_s
		p url + "-----------------------------------------------------------"
		@track.url = url

		if @track.save