app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user].permit(:username, :password, :password_confirmation))
    @user.save!
---
INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"